Revit 2027 API
IntersectionResultArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	IntersectionResult item
)
Public Overridable Sub Append (
	item As IntersectionResult
)
public:
virtual void Append(
	IntersectionResult^ item
)
abstract Append :
        item : IntersectionResult -> unit
override Append :
        item : IntersectionResult -> unit
Parameters
item IntersectionResult
See Also
Reference
IntersectionResultArray Class
Autodesk.Revit.DB Namespace